; domain
;; Domain definition
(define (domain honey-domain)

  ;; Predicates: Properties of objects that we are interested in (boolean)
  (:predicates
    (POSITION ?x) ; True if x is a position
    (ARM ?x) ; True if x is an arm
    (OBJECT ?x) ; True if x is an object
    (BEE-HOUSE ?x) ; True if x is a bee-house
    (HONEY-POT ?x) ; True if x is a honey pot
    (COSTUME ?x) ; True if x is a costume
    (person-at ?x) ; True if the person is at x
    (object-at ?x ?y) ; True if x is an object (bee-house, honey-pot or costume), y is a position and x is in y
    (free ?x) ; True if x is an arm and there is NO honey pot in it
    (hold ?x ?y) ; True if x is an arm, y is a honey pot and x holds y
    (wearing ?x) ; True if x is a costume and the person is wearing it
    (empty ?x) ; True if x is a honey pot and it is empty
    (has-honey ?x) ; True if the bee-house x has honey
  )

  (:functions
    (distance ?pos1 ?pos2)
    (amount-of-steps))

  (:action measure-distance
    ; -x: initial position
    ; -y: next step position
    :Parameters (?pos1 ?pos2)
    :precondition (and (>= (distance ?pos1 ?pos2) 0)
			(POSITION ?pos1)
			(POSITION ?pos2)
			(person-at ?pos1)
			(not (person-at ?pos2)))
    :effect (and (increase (amount-of-steps) (distance ?pos1 ?pos2))
		(person-at ?pos2)
		(not (person-at ?pos1)))
 )

  ; The person can take a costume x and put it on if she and the costume are both at position y
  ; Parameters:
  ; - x: the costume
  ; - y: the position where the person will put on the costume
  (:action wear-at
    :parameters (?x ?y)
    :precondition (and (POSITION ?y)
			(COSTUME ?x) 
			(person-at ?y)
			(not(wearing ?x))
			(object-at ?x ?y))
    :effect (and (wearing ?x)
		(not (object-at ?x ?y))
		(person-at ?y))
  )

  ; The person can take off the costume x at position y
  ; Parameters:
  ; - x: the costume
  ; - y: the position where the costume will be taken off
  (:action take-off-at
    :parameters (?x ?y)
    :precondition (and (POSITION ?y)
			(COSTUME ?x) 
			(person-at ?y)
			(wearing ?x))
    :effect (and (object-at ?x ?y)
		(not(wearing ?x))
		(person-at ?y))
  )

  ; The person can collect all honey from bee house w to honey pot x if 
  ; there is honey in the bee house, the honey pot is empty, 
  ; the person is wearing costume y, has a free arm v, and 
  ; she, the bee house and the honey pot are in the same position z.
  ; - x: the honey pot
  ; - y: the costume
  ; - z: the position where the person collects the honey
  ; - w: the bee house
  ; - v: the arm
  (:action collect
    :parameters (?x ?y ?z ?w ?v)
    :precondition (and (POSITION ?z)
			(person-at ?z)
			(ARM ?v)
			(not (free ?v))
			(COSTUME ?y)
			(wearing ?y)
			(HONEY-POT ?x)			
			(has-honey ?w)
			(BEE-HOUSE ?w)
			(empty ?x)
			(object-at ?w ?z))
     :effect (and (not (free ?v))
		(not(empty ?x))
		(person-at ?z)
		(not (has-honey ?w)))
  )

  ; The person can pick-up honey pot x with free arm y at position z
  ; - x: the honey pot
  ; - y: the arm
  ; - z: the position where the object is picked up
  (:action pick-up
    :parameters(?x ?y ?z)
    :precondition (and (POSITION ?z)
			(person-at ?z)
			(ARM ?y)
			(free ?y)
			(object-at ?x ?z)
			(HONEY-POT ?x)
			(not(hold ?y ?x)))
    :effect (and (hold ?y ?x)
		(not(free ?y))
		(not (object-at ?x ?z)))
  )

  ; The person can drop off honey pot x that she holds in arm y at position z
  ; - x: the honey pot
  ; - y: the arm
  ; - z: the position where the object is dropped off
  (:action drop-off
    :parameters (?x ?y ?z)
    :precondition (and (POSITION ?z)
			(person-at ?z)
			(ARM ?y)
			(not(free ?y))
			(HONEY-POT ?x)
			(hold ?y ?x))
    :effect (and (not(hold ?y ?x))
		(free ?y)
		(object-at ?x ?z))
  )

)

; problem
;; Problem definition
(define (problem problem-1)

  ;; Specifying the domain for the problem
  (:domain honey-domain)

  ;; Objects definition
  (:objects
    ; Positions
    home
    forest-1 forest-2
    garden
    ; Arms
    left right
    ; Bee-houses
    bee-house-1 bee-house-2
    ; Honey pots
    honey-pot-1 honey-pot-2
    ; Costumes
    costume
  )

  ;; Initial state of problem 1
  (:init
    ;; Declaration of the objects
    (POSITION home)
    (POSITION garden)
    (POSITION forest-1)
    (POSITION forest-2)
    (ARM left) 
    (ARM right)
    (OBJECT bee-house-1) 
    (OBJECT bee-house-2)
    (BEE-HOUSE bee-house-1) 
    (BEE-HOUSE bee-house-2)
    (OBJECT honey-pot-1) 
    (OBJECT honey-pot-2)
    (HONEY-POT honey-pot-1) 
    (HONEY-POT honey-pot-2)
    (OBJECT costume)
    (COSTUME costume)

    ;; Declaration of the predicates of the objects
    (free left) (free right)
    (empty honey-pot-1) 
    (empty honey-pot-2)
    (has-honey bee-house-1) 
    (has-honey bee-house-2)
    (person-at home)
    (object-at bee-house-1 forest-1) 
    (object-at bee-house-2 forest-2)
    (object-at costume garden)
    (object-at honey-pot-1 home) 
    (object-at honey-pot-2 home)

    ;; Declaration of the numeric fluents
    (= (distance home garden) 3)
    (= (distance garden home) 3)
    (= (distance home forest-1) 18)
    (= (distance forest-1 home) 18)
    (= (distance forest-1 forest-2) 5)
    (= (distance forest-2 forest-1) 5)
    (= (distance forest-2 home) 22)
    (= (distance home forest-2) 22)
    (= (distance garden forest-1) -1)
    (= (distance garden forest-2) -1)
    (= (distance forest-1 garden) -1)
    (= (distance forest-2 garden) -1)
    (= (amount-of-steps) 0)

  )

  ;; Goal specification
  (:goal (and
    (object-at honey-pot-1 home)
    (object-at honey-pot-2 home)
    (object-at costume garden)
    (not (empty honey-pot-1))
    (not (empty honey-pot-2))
    (person-at home))
  )

  ;; Metric to define how good is a plan
  (:metric minimize (amount-of-steps))

)

; plan
1. (pick-up honey-pot-1 left home)
   deleted: (free left) (object-at honey-pot-1 home)
   added: (hold left honey-pot-1)
   goals met: 3 of 6
2. (measure-distance home garden)
   deleted: (person-at home)
   added: (person-at garden)
   changed: (amount-of-steps) from 0 to 3
   goals met: 2 of 6
3. (wear-at costume garden)
   deleted: (object-at costume garden)
   added: (wearing costume)
   goals met: 1 of 6
4. (measure-distance garden home)
   deleted: (person-at garden)
   added: (person-at home)
   changed: (amount-of-steps) from 3 to 6
   goals met: 2 of 6
5. (measure-distance home forest-2)
   deleted: (person-at home)
   added: (person-at forest-2)
   changed: (amount-of-steps) from 6 to 28
   goals met: 1 of 6
6. (collect honey-pot-2 costume forest-2 bee-house-2 left)
   deleted: (empty honey-pot-2) (has-honey bee-house-2)
   goals met: 2 of 6
7. (measure-distance forest-2 forest-1)
   deleted: (person-at forest-2)
   added: (person-at forest-1)
   changed: (amount-of-steps) from 28 to 33
   goals met: 2 of 6
8. (collect honey-pot-1 costume forest-1 bee-house-1 left)
   deleted: (empty honey-pot-1) (has-honey bee-house-1)
   goals met: 3 of 6
9. (measure-distance forest-1 home)
   deleted: (person-at forest-1)
   added: (person-at home)
   changed: (amount-of-steps) from 33 to 51
   goals met: 4 of 6
10. (drop-off honey-pot-1 left home)
   deleted: (hold left honey-pot-1)
   added: (free left) (object-at honey-pot-1 home)
   goals met: 5 of 6
11. (measure-distance home garden)
   deleted: (person-at home)
   added: (person-at garden)
   changed: (amount-of-steps) from 51 to 54
   goals met: 4 of 6
12. (take-off-at costume garden)
   deleted: (wearing costume)
   added: (object-at costume garden)
   goals met: 5 of 6
13. (measure-distance garden home)
   deleted: (person-at garden)
   added: (person-at home)
   changed: (amount-of-steps) from 54 to 57
   goals met: 6 of 6
